#+LaTeX_HEADER: \newcommand \E {\mathop{\mbox{\ensuremath{\mathbb{E}}}}\nolimits}
#+LaTeX_HEADER: \renewcommand \Pr {\mathop{\mbox{\ensuremath{\mathbb{P}}}}\nolimits}
#+LaTeX_HEADER: \newcommand \defn {\mathrel{\triangleq}}
#+LaTeX_HEADER: \newcommand \Reals {\mathbb{R}}

*** Possible answer
	CLOCK: [2019-11-20 ons 14:20]--[2019-11-20 ons 14:40] =>  0:20

Let us define the fact that the defendant committed a crime as $C$ and the converse as $\neg C$. Let us also denote the event that a test is positive as $T$. Let us also define the case where the DNA being tested is the one being compared to as $M$. Then the information we have is
\begin{align}
\Pr(T \mid \neg M) &= 10^{-6}
\\
T & \textrm{~is true}
\end{align}
In order to predict whether somebody has actually committed the crime given the information, we must calculate $\Pr(C \mid T)$.
This means we must calculate the following
\begin{align}
\Pr(C \mid T) &= \Pr(C \mid M) \Pr(M \mid T) + \Pr(C \mid \neg M) \Pr(\neg M \mid T)
\\
&= \Pr(C \mid M) [1 - \Pr(\neg M \mid T) + \Pr(C \mid \neg M) \Pr(\neg M \mid T)]
\\
&= \Pr(C \mid M) [1 - \Pr(T \mid \neg M) \Pr(\neg M) / \Pr(T) + \Pr(C \mid \neg M) \Pr(T \mid \neg M) \Pr(\neg M) / \Pr(T)],
&
\Pr(T) = \Pr(T \mid M) \Pr(M) + \Pr(T \mid \neg M) [1 - \Pr(M)]
\end{align}

As you can see, we are missing four important quantities. 
- $\Pr(M)$, the /a priori/ probability that this is the defendant's DNA 
- $\Pr(T \mid M)$ the probability of a test being positive if the DNA fragments come from the same person.
- $\Pr(C \mid M)$,  the probability that the defendant committed the crime if the DNA was really theirs.
- $\Pr(C \mid \neg M)$,  the probability that the defendant committed the crime if the DNA was not  theirs.

So the false positive rate is far from sufficient evidence for a conviction and must be combined with other evidence.


*** Possible answer
	CLOCK: [2019-11-20 ons 14:40]--[2019-11-20 ons 14:58] =>  0:18

A simple example is when $U : \Reals^2 \to \Reals$, with rewards having two attributes. Then we might prefer $a$ to $b$ if $a_1 > b_1 + \epsilon$ , but if $|a_1 - b_1| \epsilon$ then we prefer $a$ to $b$ if $a_2 > b_2$. An example is if the first attribute is the IQ score of a job candidate and the second attribute their years of experience. We might prefer a brighter candidate as long as they are clearly much better (as IQ scores are fiddly), otherwise we will prefer the ones that have more experience. As an example, consider three candidates

| Id |  IQ | XP |
|----+-----+----|
| a  | 120 |  5 |
| b  | 130 |  4 |
| c  | 140 |  3 |
|----+-----+----|

In this example, we can set $\epsilon = 15$ so we prefer a candidate if he has at least an IQ score 15 points higher than another. 
Due to this, we have $a >^* c$. However, as $a$ and $b$ have similar IQs we prefer $a$ to $b$, i.e. $b >^* a$ and similarly $c >^* b$. If transitivity held, then we'd have $c >^* a$, which we don't.

Note that if we mapped these to a utility function, i.e. $U(a) = a_1 + a_2$, we will always get a transitive relation.


*** Possible answer
	CLOCK: [2019-11-20 ons 15:04]--[2019-11-20 ons 15:13] =>  0:09

In general, DP algorithms must be stochastic, so that this algorithm cannot satisfy DP at all.

In more detail, differential privacy requires that $\pi(a \mid x) \leq \pi(a \mid x') e^\epsilon$ for some $\epsilon$ for any neighbouring $x, x'$.
Consider a dataset where the $t$-th person has $x_t \in A$. Then $a_t = 1$. Consider a neighbouring dataset where $x'_t \nin A$. Then $a_t = 0$ w.p. 1, so $a_t = 1$ has probability $0$. 

\[
\pi(a \mid x) = \prod_i \pi(a_i \mid x_i)  
= \pi(a_t \mid x_t)] \prod_{i \neq t} \pi(a_i \mid x_i) 
\]
\[
\pi(a \mid x') = \prod_i \pi(a_i \mid x_i) 
= [1 - \pi(a_t \mid x_t)] \prod_{i \neq t} \pi(a_i \mid x_i) 
\]
Dividing the two, we get
\[
\pi(a \mid x)   =  \pi(a \mid x') \pi(a_t \mid x_t)] / [1 - \pi(a_t \mid x_t)].
\]
However, the ratio on the right is not bounded (i.e. it can be $\infty$), hence there is no DP.


*** Possible answer
	CLOCK: [2019-11-20 ons 15:13]--[2019-11-20 ons 15:18] =>  0:05
Variables:
- C: Chest pain
- H: Underlying health condition
- P: Doctor policy
- X: examination decision
- Y: test result.

#+BEGIN_SRC
   {H}->(C)  
    |    | 
    v    v
   (Y)<-(X)<-[P]
#+END_SRC

[ ] indicates decision variables, ( ) observed random variables, { } latent variables



*** Possible answer
	CLOCK: [2019-11-20 ons 15:18]--[2019-11-20 ons 15:21] =>  0:03

(a) means that there is no path from $x$ to $w$ given $y, z$
(b) means that there is some path from $x$ to $w$. 

So a graphical model representing this is:

#+BEGIN_SRC
(z)--\ 
 ^    |
 |    v
(x)  (w)
 |    ^
 v    |
(y)--/
#+END_SRC

** Fairness
   CLOCK: [2019-11-20 ons 15:31]--[2019-11-20 ons 15:37] =>  0:06

Consider a decision problem where a decision maker (DM) takes actions affecting a set of individuals. Let the DM's action be $a \in A$. This action results in an outcome $y \in Y$, also depending on the underlying characteristics $x$ of the population and has conditional distribution $P(y \mid x, a)$.
Assume that the DM has a utility function $U : A \times Y \to \Reals$. 
1. Complete the following formula to show how the DM would maximise expected utility, assuming she observes $x$:
\[
\max_{a} \E [U \mid a, x]
\]
Note that $\E [U \mid a, x] = \sum_y U(a, y) P(y, \mid x, a)$.

2. Assume each individual $i$ also receives some utility from the DM's actions. This is specified through a collection of utility functions $v_i : A \times Y \to \Reals$. Two typical definitions of fairness from social choice theory concentrate on maximising a /social welfare/ function that depends on the utilities of the whole population. There are two typical such functions
 (a) The (expected) total utility of the population
 (b) The (expected) utility of the worst-off member of the population.
Formalise those definitions within our framework.

(a) Can be described as $V = \sum_i v_i$. Then the objective of the decision maker would be to find an $a$ maximising
\[
\E\left[\sum_i v_i \mid a, x\right]
=
\sum_y P(y \mid a, x) \sum_i v_i(a, y) 
\]
(b) can be described as  $V = \min_i v_i$. Similarly
\[
\E\left[\sum_i v_i \mid a, x\right]
=
\sum_y P(y \mid a, x) \min_i v_i(a, y) 
\]

3. Describe a method whereby the DM can trade-off maximising her own utility and social welfare. Under which conditions do the to objectives coincide?

A simple idea is to combine the social welfare linearly with the DM's utility. Then we can try to maximise
\[
\E[(1 - \alpha) U + \alpha V \mid x, a].
\]
The two objectives obviously coincide when $U = V$. However, any utility function $U$ which has the same maximum as $V$ is compatible with social welfare. 


*** Possible answer

   CLOCK: [2019-11-20 ons 15:37]--[2019-11-20 ons 16:01] =>  0:24

1. Note that typically the symptoms and treatment effect depend on an underlying medical condition, but the question did not ask about this.
#+BEGIN_SRC
[$\pi$] ---> ($a_t$)
                ^   \
                |    \($y_t$)
                |    /
                |   /
             ($x_t$)
#+END_SRC




2. For S1, Treatment A works 15/20=3/4 and B: 90/180=1/2. Randomly assigning treatments: 3/8+1/4 = (3+2)/8 = 5/8
For S2, Treatment B works 60/90=2/3 and B: 4/10=2/5. Randomly assigning treatments: 1/3+1/5 = (3+5)/15 = 8/15
S1 has 200 patients and S2 has 100 patients, so 2/3 of people have S1. So the overall treatment rate would have been
5/8 * 2/3 + 8/15*1/3 = 10 / 24 + 8 / 45 ~ 5 / 12 + 2 / 11 ~ 7 / 12

3. It appears that Treatment A always works best, i.e. 3/4 of the time and 1/2 for each symptom.
So the overall curing rate based on the data would be 3/4 * 2/3 + 1/2*1/3 = 6/12 + 1/6 = 3/6+1/6 = 4/6=2/3.

4. Firstly, there could be hidden medical or financial costs. One treatment might be more expensive than the other, or may have more side-effects. In addition, one type of symptoms might be less acute or life-threatening than the other, thus requiring less aggressive treatment. Secondly, the new policy always uses the same treatment, and this means that we do not get information about the effectiveness of alternative treatments. This may be important in the initial stages of executing a treatment.


*** Possible answer
	CLOCK: [2019-11-20 ons 16:05]--[2019-11-20 ons 16:09] =>  0:04

We always start in state 1.
Taking action 0, we end up in state 1 again, with reward 0.
So $\E[\sum_{t=1}^2 r_t \mid a_1 = 0] = 0 + 0$.

Taking action 1, we end up in state 2 w.p 0.2 and state 1 w.p. 0.8.
So $\E[\sum_{t=1}^2 r_t \mid a_1 = 1] = 1 \times 0.8 - 1 \times 0.2 = 0.6$

So it is better to take action 1 in state 0. 

